app/views/users/create.js.erb

INSERT INTO "users" ("first_name", "last_name") VALUES ($1, $2) RETURNING "id"  [["first_name", "10"], ["last_name", "10"]]
---
  $(".confirm-user-create").show();
  $(".create-user").hide();