app/controllers/users_controller.rb

SELECT "users".* FROM "users"   ORDER BY "users"."created_at" DESC
---
  def index
    @users = User.all

INSERT INTO "users" ("first_name", "last_name") VALUES ($1, $2) RETURNING "id"  [["first_name", "adf"], ["last_name", "asdf"]]
INSERT INTO "start_ups" ("name") VALUES ($1) RETURNING "id"  [["name", "new startup"]]
UPDATE "users" SET "start_up_id" = $1 WHERE "users"."id" = 7  [["start_up_id", 9]]
---
  def create
    @user = User.create(user_params)
    startup = StartUp.create(name:"new startup")
    @user.start_up = startup
    @user.save